<template>
    <div class="content">
        <h3 style="color: red;">【1】職業基本魔防：</h3>
    【王族：10%】 【騎士0%】 【妖精25%】 【法師15%】 【黑妖10%】【龍騎士18%】【幻術士20%】
    <h3 style="color: rosybrown;">【2】精神對應魔防：</h3>
    <p>【精神7-14以下：00%】</p>
    <p>【精神15-16：03%】</p>
    <p>【精神17：06%】</p>
    <p>【精神18：10%】</p>
    <p>【精神19：15%】</p>
    <p>【精神20：21%】</p>
    <p>【精神21：28%】</p>
    <p>【精神22：37%】</p>
    <p>【精神23：47%】</p>
    <p>【精神24-26：50%】</p>
    <p>『精神 24 後 抗魔上限 + 50』這個設定已經過時</p>
    <p>PS2.全職每升2個等級會增加1%魔防值。</p>

    <h3 style="color: sandybrown;">【3】抗魔值算法：</h3>
    <p>本身精神+初始抗魔值=答案 等級/2算出來的答案2個相+=總答案</p>
    <p> PS：初始有點『精神』的各位也要把點數算進去不然會跟你算的不符合唷</p>
    <h3 style="color: seagreen;">【4】【等級+精神 空身抗魔 騎士版Lv.50~80】</h3>

    <div class="warp">
      <div class="a">
        <h3>等級50</h3>
        <p>精神15+03%=抗魔28</p>
        <p>精神16+03%=抗魔28</p>
        <p>精神17+06%=抗魔31</p>
        <p>精神18+10%=抗魔35</p>
        <p>精神19+15%=抗魔40</p>
        <p>精神20+21%=抗魔46</p>
        <p>精神21+28%=抗魔53</p>
        <p>精神22+37%=抗魔62</p>
        <p>精神23+47%=抗魔72</p>
        <p>精神24+50%=抗魔75</p>
      </div>
      <div class="a">
        <h3>等級60</h3>

        <p>精神15+03%=抗魔33</p>
        <p>精神16+03%=抗魔33</p>
        <p>精神17+06%=抗魔36</p>
        <p>精神18+10%=抗魔40</p>
        <p>精神19+15%=抗魔45</p>
        <p>精神20+21%=抗魔51</p>
        <p>精神21+28%=抗魔58</p>
        <p>精神22+37%=抗魔67</p>
        <p>精神23+47%=抗魔77</p>
        <p>精神24+50%=抗魔80</p>
      </div>
      <div class="a">
        <h3>等級70</h3>

        <p>精神15+03%=抗魔38</p>
        <p>精神16+03%=抗魔38</p>
        <p>精神17+06%=抗魔41</p>
        <p>精神18+10%=抗魔45</p>
        <p>精神19+15%=抗魔50</p>
        <p>精神20+21%=抗魔56</p>
        <p>精神21+28%=抗魔63</p>
        <p>精神22+37%=抗魔72</p>
        <p>精神23+47%=抗魔82</p>
        <p>精神24+50%=抗魔85</p>
      </div>
      <div class="a">
        <h3>等級80</h3>

        <p>精神15+03%=抗魔=43</p>
        <p>精神16+03%=抗魔=43</p>
        <p>精神17+06%=抗魔=46</p>
        <p>精神18+10%=抗魔=50</p>
        <p>精神19+15%=抗魔=55</p>
        <p>精神20+21%=抗魔=61</p>
        <p>精神21+28%=抗魔=68</p>
        <p>精神22+37%=抗魔=77</p>
        <p>精神23+47%=抗魔=87</p>
        <p>精神24+50%=抗魔=90</p>
      </div>
      </div>
    </div>
</template>

<script>
export default {
    
    
}
</script>

<style scoped>
.content{
    height: 90%;
    overflow: auto;
    font-size: 18px;
}
.tip{
    color: red;
    font-size: 24px;
    font-weight: bold;
}
</style>