<template>
    <div class="content">
        <div class="text1">
            <p>＊ 精準射擊只對玩家有效果，對怪物無效果。(這不是天M)</p>
            <p></p>
            <p>＊ 魔防達160整(或以上)就對相消免疫，同盟除外。</p>
            <p></p>
            <p>＊ 鏡反射發動機率看『精神』 (天堂內建說明看智力是錯誤的)。</p>
            <p></p>
            <p>＊ 防禦超過-128不會被計算到，也就是打架只需要防禦-125。</p>
            <p></p>
            <p>＊ 人物初始點數的「魔法命中率」，適用任何魔法。</p>
            <p></p>
            <p>＊ 拿遠程武器(弓)穿戴古代鬥士臂甲並無傷害加乘。</p>
        </div>

    <h3>【隱藏的魔法武器-水滴延遲】</h3>
    <p>+0的會延遲3秒再發動效果(+10=1.8秒)</p>
    <p>(延遲設定已改在攻擊者，所以多人攻擊同目標還是會多重發動)</p>

    <h3>【束縛術】</h3>

    <p> 紅影雙刀、深紅之弩、奪命之雷，被命中束縛術者，可以順移或回卷，但順移或回卷後，無法移動。</p>

    <h3>【法術三峰減免】</h3>
    <p>
      多對1『同時』使用魔法，第2下之後的傷害變1/3，故一群法師同時放究光效果不佳，另外幻術的奇古獸也是魔法傷害，故打架打龍搭配法師放魔法效果不佳</p>

    <h3>【戰鬥卡】</h3>
    <p>
      騎士村可以買，變一次時效10分鐘，功能(PVP+5)</p>

    <h3>【LV90進階變身】</h3>

    <p> 走速與80死騎相同，攻速&gt;80死騎，每種略不同</p>


    <p> (遠/進/魔法攻擊力+2)，魔法攻擊力非魔攻</p>

    <h3>【村莊費】</h3>

    <p> 貢獻度500可領，4小時=天堂1天，每月25日結算，並取得一張空白變身卡</p>

    <h3>【變身卡獲得方式】</h3>
    <p> 遊戲中可獲得卡片總整理：</p>
    <p> 闇龍戰士：城戰勝利方盟主(7天)</p>
    <p> 天上騎士：城戰勝利方成員(3天)</p>
    <p> 屠龍者：每期村長(5天)</p>
    <p> 變身卡：每期村民(1天)</p>
    <p> 喵小編：問答活動通關(1天)</p>
    <p> 體驗卡：骰子大賽贏家(1天)</p>
    <p> 戰鬥卡：騎村雜貨店(1天)</p>

    <h3>【空白變身卡】</h3>
    <p> (天堂白天變守護星系列、晚上變暗黑星系列)</p>

    <p> 遠距離武器(弓箭、手甲)：暗黑星海露拜 / 守護星絲莉安</p>

    <p> 長距離武器(矛、鎖鏈劍)：暗黑星艾莉絲 / 守護星普洛凱爾</p>

    <p> 近距離武器：暗黑星克特、史雷佛、哈汀 / 守護星宙斯、布魯迪卡、甘特</p>

    <p> 走速、攻速略提升</p>

    <p> (遠/進/魔法攻擊力+3)，魔法攻擊力非魔攻</p>

    <h3>【被玩家殺死所需的護身符數量】</h3>
    <p> 因為90級以上的情況才需要帶護身符</p>
    <p> 故轉數*2+等級所需數量(90級是7個)，</p>
    <p> 依此類推</p>
    <p> 0轉=7個</p>
    <p> 1轉=9個</p>
    <p> 2轉=11個</p>
    <p> 3轉=13個</p>
    <p> 4轉=15個</p>

    <h3>【幻術心靈破壞】</h3>
    <p> 悠風版本3.5版計算公式+特殊密令試煉&amp;轉生額外提升</p>
    <p> 無試煉：（精神 + 轉生次數）* 5</p>
    <p> 有試煉：（精神 + 轉生次數）* 6</p>
    <p> ※備註※</p>
    <p> 目標魔力低於5，心靈破壞無效果，</p>
    <p>因此打沒魔力的怪，或被吸完魔力的玩家無額外效果</p>

    <h3>【角色刪除時間】</h3>
    <p> (轉生次數 + 1) * 30 + (等級 - 50) * 2</p>
    <p> 譬如說，單論0轉的人物多久會刪除</p>
    <p> 50級以內都是30天</p>
    <p> 51級就是30+2=32天，</p>
    <p>60級就是30+20=50天</p>
    <p> 80級就是30+60=90天</p>
    <p>依此類推</p>

    <h3>【額外增加攻擊傷害】</h3>
    <p>等級÷10：騎士、黑妖、龍騎士、妖精(僅增加遠攻傷害)</p>

    <h3>【額外增加攻擊命中】</h3>
    <p> 等級÷5：王族、妖精(弓與火)、幻術師(杖幻)</p>
    <p> 等級÷3：騎士、黑妖、龍騎士</p>

    <p> ※換言之，96級法師少王族妖精19命中、少騎士黑妖龍騎32命中</p>

    <h3>【職業補血卷軸治癒量】</h3>
    <p> 法師、幻術：100%</p>
    <p> 妖精：88%</p>
    <p> 龍騎士：75%</p>
    <p> 王族、黑妖：63%</p>
    <p> 騎士：50%</p>

    <h3>【各職業防禦影響減傷】</h3>
    <p> 2 騎士</p>
    <p> 3 妖精、黑暗妖精、龍騎士</p>
    <p> 4 幻術師</p>
    <p> 5 王族、法師</p>

    <h3>【龍甲選擇】</h3>
    <p> 原理：</p>
    <p> "練功"打弱怪減傷會溢出(過剩)，(打架就無此顧慮)</p>
    <p> 騎士、幻術、龍騎士有天身減免技</p>
    <p> 法師只能選水甲(聖結界的關係，減免扣半)</p>

    <p> 無火子而選擇使用其他娃娃，</p>
    <p> (例如：經驗娃、職業娃、魔法袋子娃娃)，</p>
    <p> 所有除了"法師"以外職業都可選地甲或水甲，兩者省水效益相同，</p>
    <p> 地甲優點：毒抗、剋底武、剋隱武藍水滴、治癒不怕紅、易兼顧四大屬抗</p>
    <p> 水甲優點：剋隱武紅水滴與寒冰鎖鏈劍</p>

    <p> 帶火子可帶+7地甲的職業有：弓妖、王族、黑妖</p>
    <p> 其餘職業帶火子皆選水甲較優</p>
    <p> (火妖有提盾、王族雖有信念盾但天身職業減傷5太軟)</p>

    <p> (+8以上地甲較容易減傷溢出、奧塔低樓、魂塔弱房間也容易減傷溢出)</p>

    <h3>※使用損血程式測試-LinWater※</h3>
    <p> 在常練功的地方，白天不招火子，還常常被怪物打到低於7以下的數字，那就可以跟地甲說掰掰了</p>

    <h3>【龍騎士第三段開眼】</h3>
    <p> 弱點曝光，俗稱開眼，假設鎖鏈劍基傷50</p>
    <p> ※沒考密令，發動機率30%，0~4轉※</p>
    <p>第三段開眼傷害=59</p>
    <p> ※有考密令，發動機率12%，每轉1次提升3點傷害※</p>
    <p>0轉第三段開眼傷害=89</p>
    <p> 1轉第三段開眼傷害=92</p>
    <p> 2轉第三段開眼傷害=95</p>
    <p> 3轉第三段開眼傷害=98</p>
    <p> 4轉第三段開眼傷害=101</p>

    <h3>【正義值影響噴法術機率】</h3>
    <p>正義滿：0%</p>
    <p>正義滿開紅：噴1個(1%)</p>
    <p> 0~~正義滿：噴1個(5%)</p>
    <p>-1~~-9999：噴1個(10%)</p>
    <p> -1萬~~-19999：噴1~2個(15%)</p>
    <p>-2萬~~-29999：噴1~3個(20%)</p>
    <p>-3萬~~-32767：噴2~3個(25%)</p>

    <h3>【悠風額外傷害提升】</h3>
    <p> ※正義監督：玩家受到警衛傷害 *2</p>
    <p>※魔心懲戒：玩家在地獄受到傷害 *2</p>
    <p>※暗夜魔襲：夜晚怪物強度(攻擊/防禦) *1.2</p>
    <p> ※守護捍衛：早上玩家受到警衛傷害 *1.2</p>
    <p>※魔王威攝：玩家受到王的傷害 *l.2</p>
    <p>※競技衝擊：競技場內玩家到怪物傷害 *2~3</p>
    <p>※開戰宣示：受到粉紅名(紫名)玩家傷害 *1.1</p>
    <p> ※魔心嗜血：受到紅名玩家傷害 *1.15</p>
    <p>※浴血榮耀：城堡爭奪戰中受到玩家傷害 *1.1</p>

    <p>※原地不動逾3分鐘：玩家受傷害 *2</p>
    <p>靜止不動太久被打傷害加倍，因此靜止不動等王，當王一出第一下特別痛，或是有敵人飛到你身邊，一個衝暈就能將你帶走，解決方法：三不五時走動一下或使用錯位。</p>
    <p></p>
    <h3>【特別料理 減傷】</h3>
    <p>吃特別料理可以減傷+5</p>
    <p>但只可以吃兩種（經驗料理+效果料理）</p>
    <p>一種是經驗型料理+5</p>
    <p>如特別蘑菇湯,特別蟹肉湯,特別邪惡蜥蜴湯。</p>
    <p>其它全部歸類效果料理+5</p>

    <h3>【變身卷/卡】</h3>
    <p>特化變身卷 近距離 遠距離 魔法+1</p>
    <p> 進階變身卷 近距離 遠距離 魔法+2</p>
    <p> 永久變身卡 近距離 遠距離 魔法+3</p>
    <p> 戰鬥變身卡 近距離 遠距離 魔法+5</p>
    <p> 體驗變身卡-只有外型沒有加能力</p>
    <br>
    <p> PS: 戰鬥變身卡-限制打架有效，騎村購買</p>
    <p> 其餘取得的變身卡有時效 均在1~3日 能力參考 永久變身卡效果。</p>

    <h3>【害騎士變紅的方法】</h3>
    <p>創一隻低等的角色血量約100負重不回血。</p>
    <p>戰場上對手的騎士誰開反屏 衝上去砍他...</p>
    <p>基本上高手都是拿真武 反屏傷害是（雙手劍大怪數值×2機率性觸發）</p>
    <p>隨便傷害都破100...</p>
    <p>當自殺機100血砍向高等騎觸發反屏120傷害=自殺機死 =高等騎過失殺人 （紅）</p>
    <p>蟻洞變螞蟻害人 同理...</p>
    <p>一樣是低血量觸發高傷害=死亡=反屏練功的騎士紅。</p>

    <h3>【消祝福(殷海薩的祝福)】</h3>
    <p>人物只有在安全區域，每15分鐘回殷海薩的祝福，上限是200%</p>
    <p> 外型是綠色的圖示在畫面的右上角。</p>
    <p> 每當快滿的時候我們都會打怪</p>
    <p> 把它弄到歸0在讓它累積</p>
    <p> 有此祝福練功經驗都有加成...</p>
    </div>
</template>

<script>
export default {
    
    
}
</script>

<style scoped>
.content{
    height: 90%;
    overflow: auto;
    font-size: 18px;
}
.tip{
    color: red;
    font-size: 24px;
    font-weight: bold;
}

.text1{
    margin-bottom:30px ;
}
</style>