<template>
    <div class="content">
    <h3>阿筑的魅力妖精分享(有金幣多多版的)</h3>
    <p>
    </p><p>初始點數</p>
    <p> 敏捷18(命中遠距離傷害+3防禦多-2)</p>
    <p> 剩下的一點~魅力10</p>
    <br>
    <p> 51等升級之後點魅力到34</p>
    <p> 加上妖精魅力裝備總共魅力+8</p>
    <br>
    <p> 冥法君王戒指:魅力+3</p>
    <p> 藍海賊斗篷:魅力+1</p>
    <p> 曼波兔大衣:魅力+2</p>
    <p> 曼兔帽子:魅力+1</p>
    <p> 魅力內衣：魅力+1</p>
    <br>
    <p> 可以達到魅力42+12點隱藏魅力54帶9隻兔子</p>
    <p> (有魅力藥水喝魅力有敏捷就喝敏捷)升級全點敏捷到敏35</p>
    <p> 加魔法裝備弄到敏捷44打怪也可以很快</p>
    <br>
    <p> 劣勢：</p>
    <p> 1.這種魅妖的HPMP都少不穿抗斗很難抗魔100%，沒辦法打太多放範圍魔法的怪物</p>
    <p> 2.太恐怖的地方不能去</p>
    <p> 3.智力沒點補血很耗魔力</p>
    <br>
    <p> 優勢：</p>
    <p> 1.~被寵物包圍很療癒~</p>
    <p> 2.新手好賺$$</p>
    <p> 3.打夢幻之島金幣萬能藥水</p>
    <p> 4.打底比神廟的火焰碎片</p>
    <p> 5.最主要是打一些節日活動材料可以賺$$</p>
    <p> 6.利用一些小技巧可以吃一些小王(例如：惡魔 遺忘牛老大 黑長老 四色 傲慢塔10F~50F)</p>
    <p> 7.~被寵物包圍很療癒~</p>
    <br>
    <h3>阿筑的魅力妖精分享(白手起家=窮人版)</h3>
    <br>
    <p> 初始點數</p>
    <p> 魅力點到16</p>
    <p> 51等升級之後點魅力到34(這時你已經LV69)</p>
    <p> 加上免$的魅力裝備總共魅力+2</p>
    <br>
    <p> 藍海賊斗篷:魅力+1</p>
    <p> 魅力項鍊：魅力+1</p>
    <br>
    <p> 可以達到魅力36+12點隱藏魅力48帶8隻兔子</p>
    <p> 升級全點敏捷到敏35(這時你LV92)</p>
    <br>
    <p> 劣勢：</p>
    <p> 1.一開始很難練等(打怪不痛敏捷低命中率低)超可憐</p>
    <p> 2.撐到69等才會覺得好存金幣(兔子越多賺$越快)</p>
    <p> 3.如果去打強怪常常死掉也會被惡劣玩家打死</p>
    <br>
    <p> 優勢：</p>
    <p> 1.新手好賺$$~白手起家不花T就可以買到頂級平民裝備(EX：+10暗黑十字+5神射臂甲)</p>
    <p> 2.打夢幻之島金幣萬能藥水</p>
    <p> 3.點敏捷主要增加命中率(增加清怪速度就是增加賺金幣的速度)</p>
    <p> 4.打一些節日活動材料可以賺$$</p>
    <p> 5.可以拿來開多魯嘉袋子</p>
    </div>
</template>

<script>
export default {
    
    
}
</script>

<style scoped>
.content{
    height: 90%;
    overflow: auto;
    font-size: 18px;
}
.tip{
    color: red;
    font-size: 24px;
    font-weight: bold;
}

.img1{
   width: 900px;
}
</style>