<template>
    <div class="content">
    <h3 class="title">《妖精》</h3>
    <h4>【弓妖-標準型】：初始敏14精17</h4>

    <p>51級升級後點體28精21</p>

    <p>自殺洗血，之後補敏35智25</p>

    <p>(點法順序備註：敏33之前(含裝備狀態)，每一點都有提升，智16高治減免魔力4滴，智25補血量幅度最大)</p>

    <h4>【弓妖-燒怪型】：初始敏14精17</h4>

    <p>51級升級後點體28精21</p>

    <p>自殺洗血，之後補敏25智35</p>

    <p>(或體25精21，敏28智35，命中多3遠攻多1)</p>

    <h4>【弓妖-魔法命中型】：</h4>

    <p>初始敏14精14智15，</p>

    <p>51級升級後點體28精21，</p>

    <p>自殺洗血，之後補敏25智35</p>

    <p>(或體25精21，敏28智35，命中多3遠攻多1)</p>

    <p>或是</p>
    <p>初始敏14精14智15，</p>

    <p>51級升級後點體28精21，</p>

    <p>自殺洗血，之後補敏35智25</p>

    <h4>【火妖-新手型】:</h4>

    <p>初始力12體13精17</p>

    <p> 體25精神19去洗</p>

    <p>之候補力33智25敏18</p>

    <h4>【火妖-老手型】</h4>

    <p>初始力16體14或力15智15</p>

    <p> 體25精神21去洗</p>

    <p>之後補力31智25敏18</p>

    <p>(燒怪型智火妖：補智35敏18力21)</p>

    <h4>【火妖-魔命型】※我最推薦※</h4>

    <p>初始力15智15</p>

    <p> 體28精神20去洗</p>

    <p> 之後補力29智25敏18</p>

    <p>(搭配體魄與力裝2的東西可達力36，配裝較自由，可稱防裝，輸出面僅輸全力量的火妖一點點，但卻坦多了，還可以鮪魚搭配治癒卷)</p>
    <p></p>
    <h3  class="title">《法師》</h3>
    <h4>【法師-練功力量流】：</h4>

    <p>初始精18智18剩4點補力</p>

    <p> 51級升級後點體24精35自殺洗血</p>

    <p>之後補滿智35~最後補力量</p>

    <p>或</p>

    <p>初始精17智18剩5點補力</p>

    <p>51級升級後點體24精35自殺洗血</p>

    <p>之後補滿智35~最後補力量</p>

    <h4>【法師-打架敏捷流】：</h4>

    <p>初始精17智18力13</p>

    <p>51級升級後點體22精33自殺洗血</p>

    <p>之後補滿智35~敏18</p>

    <p>(備註：點敏防禦多12，空狀態命中差1，通體後命中差6)</p>

    <p>※備註：法師放負面魔法智力36，再來43，智力裝備如下↓</p>

    <p> 聖晶魔杖2、黑法師項鍊2、智力內衣1、黑長者涼鞋1、馬庫爾之帽1、巴拉卡斯的魅惑1、底比斯賀洛斯戒指1</p>
    <p></p>
    <h3  class="title">《龍騎士》</h3>
    <h4>【龍騎士-真劍力量型】：</h4>

    <p>初始力18體15，體31洗血，之後補滿力35、智25、敏18</p>

    <h4>【龍騎士-寒冰智慧型】：</h4>

    <p>初始力18體15， 體31洗血，之後補滿力25、智35、敏18</p>

    <h4>【龍騎士-燒怪衝等型】：</h4>

    <p>初始力18體15， 體31精19洗血，之後補滿智35、敏18</p>

    <p> (衝擊之膚固定傷害、不燒捲可把智力配回力量)</p>

    <p>裝備訴求：堤面、地水龍泉源(或古皮)、屬性斗篷、屬性手套、智練、+6修好耳環、+6雙抗戒</p>

    <p>或</p>

    <p>初始智17， 體31精24洗血，之後補滿智35、敏18</p>
    <p></p>
    <h3  class="title">《黑暗妖精》</h3>

    <h4>【黑暗妖精-有點智】：力18敏17體10出生，體26精23洗血，</h4>
    <p>之後補滿敏18、智25，剩餘點力量至28(此為0轉建議點法，可單打、可燒怪)</p>

    <h4>【黑暗妖精-全力敏】：力18敏17體10出生，體28精23自殺，力35敏23</h4>
    <p></p>
    <h3 class="title">《幻術師》</h3>
    <h4>【幻術師-聖晶】：力16精17出生，體25精23去洗，之後補滿智35、敏18、力20</h4>

    <h4>【幻術師-奇古】：智17精17出生，體25精25去洗，之後補滿精32、智35、敏18</h4>

    <p>或精35、智35、敏15</p>

    <p>(精35的話則是敏15，魔防多3，96級時防禦會少8，並缺少1迴避，奇古命中100%敏捷無差，所以看個人取捨)</p>
    <p></p>
    <h3  class="title">《王族》</h3>
    <h4>【王族-標準型】：力18體12智11初始，體26精23洗血，</h4>
    <p>點到力24敏18智25，靠力耳 力鍊 力套 古巨戒 體魄，達到力35(35~38為相同)，若搭配君主的威嚴，</p>
    <p> 可考慮裝備替換(如力耳換友好度耳環)，若不搭配威嚴穿抗斗可達最高魔防</p>

    <h4>【王族-燒怪型】：敏17智11初始，升級點體27精23自殺，補滿敏18智35</h4>

    <p>(初始點1智，是因為可帶治盔補初治耗魔1，敏17額外多3防禦、2回避、1遠攻)</p>

    <p>(休閒還可拿隱弓射，普攻配上密令效果也是挺痛的)</p>

    <p>※備註：王族升級※</p>
    <p>初始體18王升級=17</p>
    <p>初始體18、點至體25=21.5</p>
    <p> 初始力19體12王=15</p>

    <p> ※備註：王族收人※</p>
    <p>(初始魅力13+裝備10)*9=207人</p>

    <h3  class="title">《騎士》</h3>
    <h4>【力量騎士】：初始力20</h4>

    <p>51級升級後點體32精24自殺洗血，之後補力35敏18</p>

    <h4>【智力騎士】：</h4>
    <p>初始有4種：</p>
    <p>這兩種不打架適用↓</p>

    <p>力20智8(治盔耗魔：初治2、中治6)，</p>

    <p>力19智9(治盔耗魔：初治1、中治5)，</p>

    <p>這兩種打架適用↓</p>

    <p> 魔法命中率+1：力18智10(治盔耗魔：初治1、中治5)，</p>

    <p>魔法命中率+2：力16智12(治盔耗魔：初治1、中治4)，</p>

    <p>另外，初始力16智12，這配點可以搭配智35燒怪型</p>

    <p>51級升級後點體31精23（或體30精24) 自殺洗血，之後補智25，剩下6點補敏捷至18(或塞力量=力26)</p>

    <p>『6點補力量(力26型)』狀態下完+裝備力量35=額外12，力36多1命中，與力騎滿裝力量50=額外17，最大差5滴，無真劍力騎力43=額外14，</p>
    <p> 一刀只差2，※全力裝力騎與全力裝智騎(力26型)，一刀差5，被相消後一刀差2</p>

    <p>『6點補敏捷(敏18型)』96級時差12防，與玩家PK時，近戰閃避+2(5防多1閃)，遠距迴避率+3，命中方面與6點補力量的智騎高出3~5，是謂"極致坦"</p>

    <p>【不洗血騎士】：初始力20，精23智25力35敏18剩餘點數配體或精( 亦可力量10點改配智慧燒卷練 )</p>

    <p>※備註：騎士不洗血99級空身血魔大約(1700/180)</p>

    <p>
      參考：夢之幻影 ，配點方法 感恩。</p>
    </div>
</template>

<script>
export default {
    
    
}
</script>

<style scoped>
.content{
    height: 90%;
    overflow: auto;
}
.tip{
    color: red;
    font-size: 24px;
    font-weight: bold;
}

.title{
    font-size: 36px;
    font-weight: bold;
    color: saddlebrown;
}

</style>